BenardCellsCyclic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-4 0 0);

boundaryField
{
    floor
    {
    	type 		noSlip;
    }

    ceiling
    {
	type 		noSlip;
    } 

    patch0_half0
    {
	type 		cyclic;
    }


    patch0_half1
    {
	type 		cyclic;
    }

    patch1_half0
    {
	type 		cyclic;
    }

    patch0_half1
    {
	type 		cyclic;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
